{
  "comment": "Ambient vocabulary for docs/check.ts: identifiers a doc snippet may reference from elided surrounding code. frameworkValues/frameworkTypes are imported from commonfabric; every name in others is declared ambient (as a cell/array within a block that maps it, otherwise as any). Add a name here when a snippet legitimately references an identifier defined in code outside the snippet.",
  "todo": "Audit this allowlist periodically. Some entries may name identifiers from APIs that have since changed; where that is so, the right fix is to update the snippet to the current API and drop the entry, rather than leave it stubbed as any. Each name removed this way is one less place a doc can quietly drift from the real surface.",
  "frameworkValues": [
    "Cell",
    "FS",
    "FabricEpochDays",
    "FabricEpochNsec",
    "FabricHash",
    "FabricInstance",
    "FabricPrimitive",
    "FabricSpecialObject",
    "NAME",
    "Stream",
    "UI",
    "UiAction",
    "Writable",
    "__cfHelpers",
    "action",
    "cell",
    "cfSqlite",
    "compileAndRun",
    "computed",
    "equals",
    "fetchBinary",
    "fetchJson",
    "fetchJsonUnchecked",
    "fetchText",
    "generateObject",
    "generateText",
    "handler",
    "ifElse",
    "lift",
    "navigateTo",
    "pattern",
    "schema",
    "sqliteDatabase",
    "str",
    "table",
    "wish"
  ],
  "frameworkTypes": [
    "BrandedCell",
    "CellKind",
    "CellScope",
    "Cfc",
    "DID",
    "Default",
    "FabricValue",
    "IAnyCell",
    "IReadable",
    "JSONSchema",
    "JSONValue",
    "LinkScope",
    "Pattern",
    "PerAny",
    "PerSession",
    "PerSpace",
    "PerUser",
    "Reactive",
    "SchemaPathSelector",
    "SchemaScope",
    "SqliteDatabase",
    "SqliteDb",
    "SqliteTableSchemas",
    "VNode"
  ],
  "collections": [],
  "others": [
    "ALLOWED_LOCAL_IMPORT_PREFIXES",
    "Action",
    "AddItemEvent",
    "AddProfileElementEvent",
    "Address",
    "AisleResult",
    "ApiEdit",
    "Assertion",
    "AuthorizationError",
    "BG_CELL_CAUSE",
    "BG_SYSTEM_SPACE_ID",
    "BaseFabricCodec",
    "BaseFabricInstance",
    "Battleship",
    "Branch",
    "BranchConflict",
    "BranchId",
    "BranchLifecycleWrite",
    "BranchName",
    "Bytes",
    "CATEGORIES",
    "CFCPolicy",
    "CFTheme",
    "CODEC",
    "CODEC_TYPE_TAGS",
    "Cancel",
    "Card",
    "CauseString",
    "CellReference",
    "CellState",
    "Changes",
    "ChatProfile",
    "Chatbot",
    "Checkpoint",
    "ChildPattern",
    "ClassifiedFrame",
    "ClientCommit",
    "CodeBundle",
    "Column",
    "Commit",
    "CompoundCycleTracker",
    "Config",
    "ConflictDetail",
    "ConflictError",
    "Constructor",
    "ContactsContainer",
    "Conversation",
    "Counter",
    "CounterEvent",
    "CounterInput",
    "CounterState",
    "DEEP_FREEZE",
    "DEFAULT_BOARD",
    "DEFAULT_CONVERSATION",
    "DEFAULT_PREFS",
    "DEFAULT_PROFILE",
    "Delegation",
    "Delete",
    "DeleteOperation",
    "DependencyUpdateState",
    "DeviceInput",
    "DeviceOutput",
    "DocumentRef",
    "Draft",
    "DraftState",
    "EMPTY_DRAFT",
    "EMPTY_ROOM",
    "ENTITY_ID_BRAND",
    "Edit",
    "Engine",
    "EngineProgramResolver",
    "EntityDocument",
    "EntityId",
    "EntityRef",
    "EntitySnapshot",
    "ErrorMappingOptions",
    "EventType",
    "Expense",
    "FABRIC_ERROR_RESERVED_KEYS",
    "FRONTEND_URL",
    "FabricAwareResolver",
    "FabricBytes",
    "FabricCodec",
    "FabricMount",
    "FabricNativeObject",
    "FabricNativeWrapper",
    "FabricRef",
    "FabricRegExp",
    "FabricValueLayer",
    "Fact",
    "FactSelection",
    "FactSet",
    "Favorite",
    "FileSystemProgramResolver",
    "Foo",
    "Form",
    "FsState",
    "FullView",
    "GateState",
    "GraphQuery",
    "GridTile",
    "GridView",
    "Hash",
    "IExtendedStorageTransaction",
    "IFCLabel",
    "IMemoryAddress",
    "IMemorySpaceAddress",
    "IS_DEEP_FROZEN",
    "Identity",
    "InlineChip",
    "Input",
    "IssueCard",
    "Item",
    "ItemCard",
    "ItemDetail",
    "JsonType",
    "JsonWireValue",
    "LLMMessage",
    "LLMRequestMetadata",
    "LinkRef",
    "LinkSigil",
    "ListInput",
    "ListOutput",
    "ListView",
    "MIME",
    "MapSet",
    "MappedError",
    "MappedPosition",
    "MediaType",
    "MemoryAddressPathComponent",
    "MemorySpace",
    "MentionablePiece",
    "MergeProposal",
    "MinimalPiece",
    "ModelName",
    "MyInput",
    "NodeId",
    "NodeSpec",
    "NormalizedLink",
    "Note",
    "NoteInput",
    "NoteOutput",
    "NotePiece",
    "ObservationIdentity",
    "OpCodecId",
    "Opaque",
    "Operation",
    "Output",
    "PatchOp",
    "PatchWriteOperation",
    "Person",
    "PersonLike",
    "PieceManager",
    "PiecesController",
    "Preferences",
    "PrimitiveTypeName",
    "ProbeApi",
    "ProfileCell",
    "ProfileDefaultPattern",
    "ProfileHome",
    "ProgramResolver",
    "Query",
    "QueryOptions",
    "ReactivityLog",
    "ReadPath",
    "ReadSet",
    "ReceiptActivity",
    "ReconstructionContext",
    "Reference",
    "Result",
    "Row",
    "RunBudget",
    "Runner",
    "Runtime",
    "SESRuntime",
    "SPACE_NAME",
    "SandboxConfig",
    "SchedulerAddress",
    "SchedulerNode",
    "SchedulerRead",
    "SchemaQuery",
    "SchemaTracker",
    "SearchOutput",
    "SelectedRoom",
    "Selector",
    "SerializedAddress",
    "ServerState",
    "SessionId",
    "SessionSync",
    "SetOperation",
    "SetProfileBioEvent",
    "ShellIntegration",
    "Signature",
    "SignedClientCommit",
    "SomePrimitive",
    "Source",
    "SourceLocation",
    "SourceMap",
    "SourceMapGenerator",
    "SpaceDID",
    "SpaceId",
    "SpaceSession",
    "Spinner",
    "SqliteDbRef",
    "StackMapper",
    "State",
    "StateType",
    "Status",
    "StoredRevision",
    "SystemError",
    "TelemetryAnnotations",
    "TestOptions",
    "TestResult",
    "TestResults",
    "Todo",
    "TodoInput",
    "TodoItem",
    "TodoItemPiece",
    "TodoListInput",
    "TodoListOutput",
    "TodoOutput",
    "Transaction",
    "TransactionError",
    "TrustedProfile",
    "UNSAFE_KEYS",
    "URI",
    "UnknownValue",
    "UnsignedReceipt",
    "User",
    "ValidationResult",
    "WatchSpec",
    "WebhookEvent",
    "Write",
    "__cfHandler_1",
    "__cfHardenFn",
    "__cfLift_1",
    "__cfPattern_1",
    "__cfReg",
    "a",
    "absFilePath",
    "actionId",
    "actionIds",
    "actionIsEffect",
    "actionOrId",
    "action_add_item",
    "action_do_something",
    "action_remove_item",
    "action_update_item",
    "addItem",
    "addItemHandler",
    "adminMode",
    "aliases",
    "allItems",
    "allPieces",
    "allowMutableTransactionRead",
    "apiUrl",
    "applyEditToFilesystem",
    "applyOp",
    "argSchema",
    "arr",
    "articles",
    "asKey",
    "assert_empty",
    "assert_empty_again",
    "assert_has_one_item",
    "assert_item_updated",
    "assert_something",
    "assert_starts_empty",
    "avatar",
    "b",
    "baseEntries",
    "baseTools",
    "beforeEach",
    "bio",
    "boundJoin",
    "branchA",
    "branchB",
    "buf",
    "buildCurrentWorkSet",
    "buildStateFromFs",
    "cacheMap",
    "calculator",
    "callableCell",
    "callback",
    "cancelEdit",
    "canonicalId",
    "captures",
    "cart",
    "cascadedRejection",
    "categories",
    "category",
    "cellA",
    "cellB",
    "cfThemeContext",
    "changes",
    "children",
    "classifyAndFormatMappedError",
    "closeModal",
    "collectDirtyDependencies",
    "collectNewSubscriptionDependencies",
    "collection",
    "commit",
    "commonfabric",
    "compareFn",
    "computationsUsing",
    "computeId",
    "condition",
    "configCell",
    "consume",
    "content",
    "contractor",
    "conversation",
    "count",
    "counter",
    "counterA",
    "counterB",
    "createBuilder",
    "createRef",
    "currentProfileCell",
    "currentRawValue",
    "currentView",
    "data",
    "date",
    "db",
    "debounce",
    "deck",
    "decks",
    "deepFreeze",
    "defaultTheme",
    "derivedEntry",
    "derivedValue",
    "describe",
    "dialogOpen",
    "doSomething",
    "durationMs",
    "edit",
    "editContent",
    "edits",
    "editsCell",
    "effectiveLayout",
    "enabled",
    "entityId",
    "entries",
    "entryRefByValue",
    "error",
    "evaluateInCallbackCompartment",
    "eventData",
    "existingRecordData",
    "expect",
    "expected",
    "expectedValue",
    "expenses",
    "expensive",
    "expensiveCalculation",
    "extraTools",
    "extractedLabels",
    "fabricFromNativeValue",
    "failedEditsCell",
    "favoritesView",
    "file",
    "findMatchingEdit",
    "findMountForPath",
    "findOverlappingWritesAfter",
    "findSchedulerReadersForWrite",
    "fn",
    "formatFrame",
    "frameCause",
    "freezeVerifiedPlainData",
    "friend",
    "friendJohn",
    "fromBase64url",
    "fs",
    "fuse_session_fd",
    "fuse_session_process_buf",
    "game",
    "gameState",
    "generateId",
    "generatedSource",
    "getCanonicalId",
    "getCurrentFact",
    "getFormattedDate",
    "getLogger",
    "github",
    "goToReview",
    "googleContactsImport",
    "grouped",
    "handleSubmit",
    "hash",
    "helperIndex",
    "identity",
    "identityByPath",
    "ignoreReadForScheduling",
    "image",
    "immediateLog",
    "implementationHash",
    "importEdges",
    "incrementHandler",
    "input",
    "inputIds",
    "inputModel",
    "inputSchema",
    "inputSourceMap",
    "inputs",
    "inputsCell",
    "invokePattern",
    "isEffect",
    "isFabricImportSpecifier",
    "isRuntimeModuleIdentifier",
    "isSorted",
    "isSystemError",
    "isVisibleInSession",
    "issueListRef",
    "it",
    "item",
    "items",
    "joinName",
    "js",
    "kernel",
    "key",
    "labelMap",
    "level",
    "list",
    "lives",
    "loadManager",
    "loadPattern",
    "logArray",
    "logger",
    "manager",
    "mappedProgram",
    "markReadAsAttemptedWrite",
    "markStale",
    "maybeRunScheduledAction",
    "menuOpen",
    "mergeSourceMaps",
    "module",
    "mounted",
    "ms",
    "multiplier",
    "myCell",
    "myPerSpaceCell",
    "myProfile",
    "myUI",
    "newEntry",
    "newNote",
    "newPiece",
    "newState",
    "newValue",
    "next",
    "nextSequenceNumber",
    "note",
    "notebook",
    "notification",
    "obj",
    "of",
    "openTarget",
    "optOut",
    "options",
    "otherItem",
    "output",
    "outputSchema",
    "outputSourceMap",
    "page",
    "parseFabricRef",
    "parseMountedCallablePath",
    "participants",
    "path",
    "pending",
    "pendingDependency",
    "people",
    "piece",
    "pieceCell",
    "pieceId",
    "popFrame",
    "populateDependencies",
    "preflightCompiledBundle",
    "previousCommitReference",
    "process",
    "processArray",
    "processNull",
    "processObject",
    "processPrimitive",
    "processRequest",
    "processStr",
    "processedEvents",
    "program",
    "promptSource",
    "props",
    "pushFrameFromCause",
    "readFilesystemState",
    "readMountedPieceMeta",
    "receiptCell",
    "refer",
    "registerProfile",
    "registry",
    "relativePathWithinMount",
    "removeItem",
    "renderItem",
    "resSchema",
    "result",
    "resultCell",
    "retryEdit",
    "rows",
    "runtime",
    "runtimeClient",
    "score",
    "searchQuery",
    "searchWeb",
    "selectItem",
    "selectRoom",
    "selected",
    "selectedDeckIndex",
    "selectedIndex",
    "selectedItem",
    "selectedRoom",
    "selectedScopes",
    "serializedResult",
    "session",
    "sessionContext",
    "sessionLink",
    "sessionState",
    "setAssign",
    "setTitle",
    "sharedLink",
    "sharedProfiles",
    "show",
    "showAdd",
    "showAdmin",
    "showDetails",
    "showForm",
    "slot",
    "snapshot",
    "snapshotAndHardenModuleSafeData",
    "someCell",
    "someFunction",
    "sortAndCompactPaths",
    "source",
    "sourceInfluence",
    "sourceRef",
    "sourceRisk",
    "space",
    "spaceDID",
    "spacesView",
    "sql",
    "stableConfigJson",
    "startTimestamp",
    "state",
    "stateCell",
    "statusMessage",
    "storageManager",
    "stream",
    "subPattern",
    "subject",
    "submit",
    "surfaceName",
    "tables",
    "tags",
    "the",
    "theme",
    "timeout",
    "title",
    "toMemorySpaceAddress",
    "toUnpaddedBase64url",
    "todos",
    "topologicalSort",
    "trackedInputs",
    "transaction",
    "transform",
    "trustedBuilderArtifacts",
    "trustedPatterns",
    "ts",
    "tx",
    "txToReactivityLog",
    "unwrapTag",
    "url",
    "user",
    "userCell",
    "userDid",
    "userId",
    "userInput",
    "username",
    "usernameError",
    "users",
    "v",
    "valid",
    "value",
    "valueDigest",
    "vmHandle",
    "waitFor",
    "waitForCondition",
    "watchPath",
    "wishResult",
    "workContactsImport",
    "workSet",
    "wrapTag",
    "x",
    "yourPatternCode"
  ]
}